Reports/DMS_ВоронкаПродажПоМоделямИМенеджерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>DMS_ВоронкаПродажПоМоделямИМенеджерам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_РабочийЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_РабочийЛист</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/DMS_ВоронкаПродажПоМоделямИМенеджерам/Ext/ObjectModule.bsl
#Область ФормированиеОтчета

// Формирует табличный документ отчета
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Результат формирования отчета
//
Функция СформироватьОтчет() Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьДилерскийЦентр 	= Макет.ПолучитьОбласть("ДилерскийЦентр");
	ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьБренд 			= Макет.ПолучитьОбласть("Бренд");
	ОбластьСтрокаМенеджер 	= Макет.ПолучитьОбласть("СтрокаМенеджер");
	ОбластьСтрокаОтдел 		= Макет.ПолучитьОбласть("СтрокаОтдел");
	
	Запрос = ПолучитьЗапросДляОтчета();
	ВыборкаДЦ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДЦ.Следующий() Цикл
		
		ОбластьДилерскийЦентр.Параметры.ДилерскийЦентр = ВыборкаДЦ.ДилерскийЦентр;
		ТабличныйДокумент.Вывести(ОбластьДилерскийЦентр);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаБренд = ВыборкаДЦ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаБренд.Следующий() Цикл
			
			ОбластьБренд.Параметры.Бренд = ВыборкаБренд.Бренд;
			
			ВыборкаМодели = ВыборкаБренд.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаМодели.Следующий() Цикл
			
				ВыборкаОтделы = ВыборкаМодели.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
				Пока ВыборкаОтделы.Следующий() Цикл
					
					ОбластьСтрокаОтдел.Параметры.Заполнить(ВыборкаОтделы);
					
					ВыборкаМенеджеры = ВыборкаОтделы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаМенеджеры.Следующий() Цикл
						
						ОбластьСтрокаМенеджер.Параметры.Заполнить(ВыборкаМенеджеры);
						ТабличныйДокумент.Вывести(ОбластьСтрокаМенеджер);
						
					КонецЦикла;

					ТабличныйДокумент.Вывести(ОбластьСтрокаОтдел);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекМодель = ТабличныйДокумент.Область(5, 1).Текст;
	НачалоМодели = 5;
	
	Для сч = 5 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		ЭтоДЦ = Лев(ТабличныйДокумент.Область(сч, 1).Текст, 17) = "Дилерский центр: ";
		
		Если ТабличныйДокумент.Область(сч, 1).Текст <> ТекМодель ИЛИ ЭтоДЦ Тогда
			
			ТабличныйДокумент.Область(НачалоМодели, 1, сч - 1, 1).Объединить();
			ТабличныйДокумент.Область(НачалоМодели, 1, сч - 1, 1).ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			ТекМодель = ТабличныйДокумент.Область(сч, 1).Текст; 
			НачалоМодели = сч;
						
		КонецЕсли;
		
		Если ЭтоДЦ Тогда
			сч = сч + 3;
			НачалоМодели = сч;
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Область(НачалоМодели, 1, ТабличныйДокумент.ВысотаТаблицы , 1).Объединить();
	ТабличныйДокумент.Область(НачалоМодели, 1, ТабличныйДокумент.ВысотаТаблицы , 1).ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьОтчет()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает запрос для формирования отчета
// 
// Возвращаемое значение:
//  Запрос - Запрос для отчета
//
Функция ПолучитьЗапросДляОтчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Renault_РабочийЛист.ДилерскийЦентр,
	|	Renault_РабочийЛист.ДилерскийЦентр.Бренд КАК Бренд,
	|	Renault_РабочийЛист.МодельАвтомобиля КАК Модель,
	|	Renault_РабочийЛист.Сотрудник,
	|	Renault_РабочийЛист.Отдел,
	|	CRM_ВоронкаПродаж.ЭтапПродаж,
	|	CRM_ВоронкаПродаж.ДатаВыполнения,
	|	Renault_РабочийЛист.IDK КАК IDK,
	|	Renault_РабочийЛист.ЛистЗакрыт
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛист КАК Renault_РабочийЛист
	|		ПО CRM_ВоронкаПродаж.IDK = Renault_РабочийЛист.IDK
	|ГДЕ
	|	Renault_РабочийЛист.Отдел.ПродажаАвтомобилей
	|	И CRM_ВоронкаПродаж.ДатаВыполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_Трафик.ДилерскийЦентр.Бренд КАК Бренд,
	|	Renault_Трафик.ДилерскийЦентр,
	|	Renault_Трафик.Отдел,
	|	Renault_Трафик.Менеджер,
	|	ВЫРАЗИТЬ(Renault_Трафик.ПервичныйИнтерес.Модель КАК Справочник.Модели) КАК Модель,
	|	Renault_Трафик.Идентификатор,
	|	Renault_Трафик.ТипТрафика
	|ПОМЕСТИТЬ ВТ_Трафик
	|ИЗ
	|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|ГДЕ
	|	Renault_Трафик.Отдел.ПродажаАвтомобилей
	|	И Renault_Трафик.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТрафикСрезПервых.Идентификатор КАК Идентификатор,
	|	Renault_ТрафикСрезПервых.Период
	|ПОМЕСТИТЬ ВТ_ПервоначальныйТрафик
	|ИЗ
	|	РегистрСведений.Renault_Трафик.СрезПервых(, Отдел.ПродажаАвтомобилей) КАК Renault_ТрафикСрезПервых
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_Трафик.Идентификатор,
	|	Renault_Трафик.ТипТрафика
	|ПОМЕСТИТЬ ВТ_ПервоначальныйТрафикСТипом
	|ИЗ
	|	ВТ_ПервоначальныйТрафик КАК ВТ_ПервоначальныйТрафик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_Трафик КАК Renault_Трафик
	|		ПО ВТ_ПервоначальныйТрафик.Идентификатор = Renault_Трафик.Идентификатор
	|			И ВТ_ПервоначальныйТрафик.Период = Renault_Трафик.Период
	|ГДЕ
	|	Renault_Трафик.Отдел.ПродажаАвтомобилей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_РабочийЛист.IDK КАК IDK,
	|	ВТ_ПервоначальныйТрафикСТипом.ТипТрафика
	|ПОМЕСТИТЬ ВТ_ПервоначальныйТрафикПоРабочимЛистам
	|ИЗ
	|	ВТ_ПервоначальныйТрафикСТипом КАК ВТ_ПервоначальныйТрафикСТипом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_РабочийЛист КАК Renault_РабочийЛист
	|		ПО ВТ_ПервоначальныйТрафикСТипом.Идентификатор = Renault_РабочийЛист.IDТрафика
	|ГДЕ
	|	Renault_РабочийЛист.Отдел.ПродажаАвтомобилей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник КАК Менеджер,
	|	ВТ_ИсходныеДанные.Отдел,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.ДатаВыполнения) КАК Посещения,
	|	NULL КАК ТестДрайвы,
	|	NULL КАК Лиды,
	|	NULL КАК Звонки,
	|	NULL КАК РабочиеЛисты,
	|	NULL КАК ВесьТрафик,
	|	NULL КАК Контракты,
	|	NULL КАК ПосещенияПоЗвонкам,
	|	NULL КАК ПосещенияПоЛиду,
	|	NULL КАК ЗакрытыеРабочиеЛисты,
	|	NULL КАК Продано
	|ПОМЕСТИТЬ ВТ_Показатели
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ПосещениеАвтосалона)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.Модель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.ДатаВыполнения),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ТестДрайв)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Трафик.ДилерскийЦентр,
	|	ВТ_Трафик.Бренд,
	|	ВТ_Трафик.Модель,
	|	ВТ_Трафик.Менеджер,
	|	ВТ_Трафик.Отдел,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(ВТ_Трафик.Идентификатор),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_Трафик КАК ВТ_Трафик
	|ГДЕ
	|	(ВТ_Трафик.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидДилера)
	|			ИЛИ ВТ_Трафик.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидКорпоратRenault)
	|			ИЛИ ВТ_Трафик.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидRenault))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Трафик.ДилерскийЦентр,
	|	ВТ_Трафик.Бренд,
	|	ВТ_Трафик.Отдел,
	|	ВТ_Трафик.Модель,
	|	ВТ_Трафик.Менеджер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Трафик.ДилерскийЦентр,
	|	ВТ_Трафик.Бренд,
	|	ВТ_Трафик.Модель,
	|	ВТ_Трафик.Менеджер,
	|	ВТ_Трафик.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(ВТ_Трафик.Идентификатор),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_Трафик КАК ВТ_Трафик
	|ГДЕ
	|	ВТ_Трафик.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.Звонок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Трафик.Менеджер,
	|	ВТ_Трафик.Бренд,
	|	ВТ_Трафик.Отдел,
	|	ВТ_Трафик.ДилерскийЦентр,
	|	ВТ_Трафик.Модель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.IDK),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Модель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Трафик.ДилерскийЦентр,
	|	ВТ_Трафик.Бренд,
	|	ВТ_Трафик.Модель,
	|	ВТ_Трафик.Менеджер,
	|	ВТ_Трафик.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(ВТ_Трафик.Идентификатор),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_Трафик КАК ВТ_Трафик
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Трафик.Модель,
	|	ВТ_Трафик.Менеджер,
	|	ВТ_Трафик.Бренд,
	|	ВТ_Трафик.Отдел,
	|	ВТ_Трафик.ДилерскийЦентр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.ДатаВыполнения),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ДКП)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Бренд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.ДатаВыполнения),
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ПервоначальныйТрафикПоРабочимЛистам КАК ВТ_ПервоначальныйТрафикПоРабочимЛистам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ПО (ВТ_ПервоначальныйТрафикПоРабочимЛистам.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.Звонок)
	|				ИЛИ ВТ_ПервоначальныйТрафикПоРабочимЛистам.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ХолодныйЗвонок))
	|			И (ВТ_ИсходныеДанные.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ПосещениеАвтосалона))
	|			И (ВТ_ИсходныеДанные.IDK = ВТ_ПервоначальныйТрафикПоРабочимЛистам.IDK)
	|ГДЕ
	|	ВТ_ПервоначальныйТрафикПоРабочимЛистам.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.Звонок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Бренд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.ДатаВыполнения),
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ПервоначальныйТрафикПоРабочимЛистам КАК ВТ_ПервоначальныйТрафикПоРабочимЛистам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ПО (ВТ_ПервоначальныйТрафикПоРабочимЛистам.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидДилера)
	|				ИЛИ ВТ_ПервоначальныйТрафикПоРабочимЛистам.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидКорпоратRenault)
	|				ИЛИ ВТ_ПервоначальныйТрафикПоРабочимЛистам.ТипТрафика = ЗНАЧЕНИЕ(Справочник.CRM_ТипТрафика.ЛидRenault))
	|			И (ВТ_ИсходныеДанные.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ПосещениеАвтосалона))
	|			И (ВТ_ИсходныеДанные.IDK = ВТ_ПервоначальныйТрафикПоРабочимЛистам.IDK)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Бренд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.IDK),
	|	NULL
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ЛистЗакрыт = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Модель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.Модель,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.ДатаВыполнения)
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ВыдачаАвтомобиля)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Бренд,
	|	ВТ_ИсходныеДанные.ДилерскийЦентр,
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.Отдел,
	|	ВТ_ИсходныеДанные.Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Показатели.ДилерскийЦентр,
	|	ВТ_Показатели.Бренд,
	|	ЕСТЬNULL(ВТ_Показатели.Модель, ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК Модель,
	|	ВТ_Показатели.Менеджер,
	|	ВТ_Показатели.Отдел,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.ТестДрайвы, 0)) КАК ТестДрайвы,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.Лиды, 0)) КАК Лиды,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.Звонки, 0)) КАК Звонки,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.РабочиеЛисты, 0)) КАК РабочиеЛисты,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.ВесьТрафик, 0)) КАК ВесьТрафик,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.Контракты, 0)) КАК Контракты,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.ПосещенияПоЗвонкам, 0)) КАК ПосещенияПоЗвонкам,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.ПосещенияПоЛиду, 0)) КАК ПосещенияПоЛиду,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.ЗакрытыеРабочиеЛисты, 0)) КАК ЗакрытыеРабочиеЛисты,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.Продано, 0)) КАК Продано,
	|	СУММА(ЕСТЬNULL(ВТ_Показатели.Посещения, 0)) КАК Посещения
	|ПОМЕСТИТЬ ВТ_ПоказателиОтчета
	|ИЗ
	|	ВТ_Показатели КАК ВТ_Показатели
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Показатели.ДилерскийЦентр,
	|	ВТ_Показатели.Бренд,
	|	ВТ_Показатели.Модель,
	|	ВТ_Показатели.Менеджер,
	|	ВТ_Показатели.Отдел,
	|	ЕСТЬNULL(ВТ_Показатели.Модель, ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиОтчета.ДилерскийЦентр,
	|	ВТ_ПоказателиОтчета.Бренд,
	|	ВТ_ПоказателиОтчета.Модель,
	|	ВТ_ПоказателиОтчета.Менеджер,
	|	ВТ_ПоказателиОтчета.Отдел,
	|	СУММА(ВТ_ПоказателиОтчета.ТестДрайвы) КАК ТестДрайвы,
	|	СУММА(ВТ_ПоказателиОтчета.Лиды) КАК Лиды,
	|	СУММА(ВТ_ПоказателиОтчета.Звонки) КАК Звонки,
	|	СУММА(ВТ_ПоказателиОтчета.РабочиеЛисты) КАК РабочиеЛисты,
	|	СУММА(ВТ_ПоказателиОтчета.ВесьТрафик) КАК ВесьТрафик,
	|	СУММА(ВТ_ПоказателиОтчета.Контракты) КАК Контракты,
	|	СУММА(ВТ_ПоказателиОтчета.ПосещенияПоЗвонкам) КАК ПосещенияПоЗвонкам,
	|	СУММА(ВТ_ПоказателиОтчета.ПосещенияПоЛиду) КАК ПосещенияПоЛиду,
	|	СУММА(ВТ_ПоказателиОтчета.ЗакрытыеРабочиеЛисты) КАК ЗакрытыеРабочиеЛисты,
	|	СУММА(ВТ_ПоказателиОтчета.Продано) КАК Продано,
	|	СУММА(ВТ_ПоказателиОтчета.Посещения) КАК Посещения
	|ПОМЕСТИТЬ ВТ_ПоказателиСгруппированные
	|ИЗ
	|	ВТ_ПоказателиОтчета КАК ВТ_ПоказателиОтчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказателиОтчета.ДилерскийЦентр,
	|	ВТ_ПоказателиОтчета.Отдел,
	|	ВТ_ПоказателиОтчета.Бренд,
	|	ВТ_ПоказателиОтчета.Модель,
	|	ВТ_ПоказателиОтчета.Менеджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиСгруппированные.ДилерскийЦентр КАК ДилерскийЦентр,
	|	ВТ_ПоказателиСгруппированные.Бренд КАК Бренд,
	|	ВТ_ПоказателиСгруппированные.Модель КАК Модель,
	|	ВТ_ПоказателиСгруппированные.Менеджер КАК Менеджер,
	|	ВТ_ПоказателиСгруппированные.Отдел КАК Отдел,
	|	ВТ_ПоказателиСгруппированные.ТестДрайвы КАК ТестДрайвы,
	|	ВТ_ПоказателиСгруппированные.Лиды КАК Лиды,
	|	ВТ_ПоказателиСгруппированные.Звонки КАК Звонки,
	|	ВТ_ПоказателиСгруппированные.РабочиеЛисты КАК РабочиеЛисты,
	|	ВТ_ПоказателиСгруппированные.ВесьТрафик КАК ВесьТрафик,
	|	ВТ_ПоказателиСгруппированные.Контракты КАК Контракты,
	|	ВТ_ПоказателиСгруппированные.ПосещенияПоЗвонкам КАК ПосещенияПоЗвонкам,
	|	ВТ_ПоказателиСгруппированные.ПосещенияПоЛиду КАК ПосещенияПоЛиду,
	|	ВТ_ПоказателиСгруппированные.ЗакрытыеРабочиеЛисты КАК ЗакрытыеРабочиеЛисты,
	|	ВТ_ПоказателиСгруппированные.Посещения КАК Посещения,
	|	ВЫБОР
	|		КОГДА ВТ_ПоказателиСгруппированные.РабочиеЛисты > 0
	|			ТОГДА ВТ_ПоказателиСгруппированные.Продано * 100 / ВТ_ПоказателиСгруппированные.РабочиеЛисты
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентПродажПоРЛ,
	|	ВЫБОР
	|		КОГДА ВТ_ПоказателиСгруппированные.Посещения > 0
	|			ТОГДА ВТ_ПоказателиСгруппированные.ПосещенияПоЛиду * 100 / ВТ_ПоказателиСгруппированные.Посещения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентПосещенийПоЛиду,
	|	ВЫБОР
	|		КОГДА ВТ_ПоказателиСгруппированные.Посещения > 0
	|			ТОГДА ВТ_ПоказателиСгруппированные.ТестДрайвы * 100 / ВТ_ПоказателиСгруппированные.Посещения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентПосещенийСТестДрайвом,
	|	ВЫБОР
	|		КОГДА ВТ_ПоказателиСгруппированные.Посещения > 0
	|			ТОГДА ВТ_ПоказателиСгруппированные.ПосещенияПоЗвонкам * 100 / ВТ_ПоказателиСгруппированные.Посещения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентПосещенийПоЗвонкам,
	|	ВЫБОР
	|		КОГДА ВТ_ПоказателиСгруппированные.ВесьТрафик > 0
	|			ТОГДА ВТ_ПоказателиСгруппированные.РабочиеЛисты * 100 / ВТ_ПоказателиСгруппированные.ВесьТрафик
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентТрафикаСРабочимЛистом,
	|	ВЫБОР
	|		КОГДА ВТ_ПоказателиСгруппированные.РабочиеЛисты > 0
	|			ТОГДА ВТ_ПоказателиСгруппированные.ЗакрытыеРабочиеЛисты * 100 / ВТ_ПоказателиСгруппированные.РабочиеЛисты
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентЗакрытыхРабочихЛистов
	|ИЗ
	|	ВТ_ПоказателиСгруппированные КАК ВТ_ПоказателиСгруппированные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПоказателиСгруппированные.ДилерскийЦентр.Наименование,
	|	ВТ_ПоказателиСгруппированные.Бренд.Наименование,
	|	ВТ_ПоказателиСгруппированные.Модель.Наименование,
	|	ВТ_ПоказателиСгруппированные.Менеджер.Наименование
	|ИТОГИ
	|	СУММА(ТестДрайвы),
	|	СУММА(Лиды),
	|	СУММА(Звонки),
	|	СУММА(РабочиеЛисты),
	|	СУММА(ВесьТрафик),
	|	СУММА(Контракты),
	|	СУММА(ПосещенияПоЗвонкам),
	|	СУММА(ПосещенияПоЛиду),
	|	СУММА(ЗакрытыеРабочиеЛисты),
	|	СУММА(Посещения),
	|	СРЕДНЕЕ(ПроцентПродажПоРЛ),
	|	СРЕДНЕЕ(ПроцентПосещенийПоЛиду),
	|	СРЕДНЕЕ(ПроцентПосещенийСТестДрайвом),
	|	СРЕДНЕЕ(ПроцентПосещенийПоЗвонкам),
	|	СРЕДНЕЕ(ПроцентТрафикаСРабочимЛистом),
	|	СРЕДНЕЕ(ПроцентЗакрытыхРабочихЛистов)
	|ПО
	|	ДилерскийЦентр,
	|	Бренд,
	|	Модель,
	|	Отдел,
	|	Менеджер";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ДатаОкончания));
	
	Возврат Запрос;	
	
КонецФункции // ПолучитьЗапросДляОтчета()

#КонецОбласти
